Embdefire/emXGUI_demo_stm32h750_v/使用单片外部FLASH/99-freeRTOS+emXGUI综合程序/emXGUI_Lib/drv/gui_picture_port.h
#ifndef __GUI_PICTURE_PORT_H
#define	__GUI_PICTURE_PORT_H

#if defined(STM32F429_439xx)
#include "stm32f4xx.h"
#elif defined(STM32H743xx)
#include "stm32h7xx.h"
#endif
#include "emXGUI.h"

void _ShowBMPEx(const char * sFilename, uint16_t usPOSX, uint16_t usPOSY) ;
void _ShowJPEGEx(const char * sFilename, uint16_t usPOSX, uint16_t usPOSY) ; 
void _ShowGIFEx(const char * sFilename, uint16_t usPOSX, uint16_t usPOSY,uint32_t ctime);  
void _ShowGIF(uint8_t * imgBuffer, uint32_t BufferSize,uint16_t usPOSX, uint16_t usPOSY,uint32_t ctime)  ;
void _DrawPNG_file(const char * sFilename, uint16_t usPOSX, uint16_t usPOSY); 
BOOL PIC_BMP_GetInfo_FS(BITMAPINFO *bm_info, char *file_name);
BOOL PIC_BMP_Draw_FS(HDC hdc, int x, int y, char *file_name, const RECT *lprc);
BOOL PIC_BMP_Draw_Res(HDC hdc, int x, int y, char *file_name, const RECT *lprc);

#endif /* __GUI_PICTURE_PORT_H */
